---
title: ExternalFileReference
classe: Autodesk.Revit.DB.ExternalFileReference
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# ExternalFileReference

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ExternalFileReferenceType ExternalFileReferenceType { get; }` | `externalFileReference.ExternalFileReferenceType` | ExternalFileReferenceType |
| `Boolean IsValidObject { get; }` | `externalFileReference.IsValidObject` | Boolean |
| `PathType PathType { get; }` | `externalFileReference.PathType` | PathType |
| `Void Dispose()` | `externalFileReference.Dispose()` | Void |
| `ModelPath GetAbsolutePath()` | `externalFileReference.GetAbsolutePath()` | ModelPath |
| `LinkedFileStatus GetLinkedFileStatus()` | `externalFileReference.GetLinkedFileStatus()` | LinkedFileStatus |
| `ModelPath GetPath()` | `externalFileReference.GetPath()` | ModelPath |
| `ElementId GetReferencingId()` | `externalFileReference.GetReferencingId()` | ElementId |
| `Boolean IsValidExternalFileReference(ExternalFileReference)` | `ExternalFileReference.IsValidExternalFileReference(data)` | Boolean |
| `Boolean IsValidPathTypeForExternalFileReference(PathType)` | `externalFileReference.IsValidPathTypeForExternalFileReference(pathType)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```